---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Porosity
source: html/d9ffed29-893c-ff8b-b262-070be728229d.htm
---
# Autodesk.Revit.DB.ThermalAsset.Porosity Property

The porosity of the asset.

## Syntax (C#)
```csharp
public double Porosity { get; set; }
```

## Remarks
Values must be in the range 0 to 1.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for porosity is out of range